> **Professora: Sthefanie Passo**

## **Soluções de Business Intelligence (BI)**

Business Intelligence pode ser descrito como um processo orientado pela tecnologia para analisar dados e apresentar informações acionáveis para ajudar executivos, gerentes e outros usuários finais corporativos a tomar decisões de negócios bem informadas.

Assim, o BI engloba uma ampla variedade de ferramentas, aplicativos e metodologias que possibilitam às organizações coletarem dados de sistemas internos e fontes externas, preparando-os para análise e desenvolvendo consultas em relação a eles.

As ferramentas de Business Intelligence são capazes de acessar e examinar conjuntos de dados apresentando seus resultados em relatórios analíticos, resumos, painéis gráficos e mapas, visando fornecer aos utilizadores informações detalhadas sobre o estado do negócio.

[Soluções de Business Intelligence](https://www.knowsolution.com.br/o-que-e-business-intelligence-bi/)

## **Atuação em desenvolvimento de sistemas transacionais (OLTP)**
As siglas OLTP e OLAP são bastante utilizadas no universo do Business Intelligence (BI). Porém, ambas possuem conceitos divergentes e são aplicadas em contextos diferentes. Neste artigo entenderemos melhor cada uma.

O OLTP, do inglês "On-line Transaction Processing", é o termo usado para se referir aos sistemas transacionais, ou seja, os sistemas operacionais das organizações. São utilizados no processamento dos dados de rotina que são gerados diariamente através dos sistemas informacionais da empresa e dão suporte às funções de execução do negócio organizacional.

Já o OLAP, do inglês "On-line Analytical Processing", trata da capacidade de analisar grandes volumes de informações nas mais diversas perspectivas dentro de um Data Warehouse (DW). O OLAP também faz referência às ferramentas analíticas utilizadas no BI para a visualização das informações gerenciais e dá suporte para as funções de análises do negócio organizacional.

![texto do link](https://ib.canaltech.com.br/252473.png)


[OLTP e OLAP](https://canaltech.com.br/business-intelligence/o-que-significa-oltp-e-olap-na-pratica/)

##**SQL**

Para termos um banco de dados temos que criar tabelas com os dados que precisamos guardar. Para isso SQL auxilia na criação de tabelas, segurança e busca de dados.

Structured Query Language (SQL) é a linguagem usada para armazenar, manipular e recuperar dados de muitos bancos de dados. É a linguagem padrão para muitos sistemas de gerenciamento de banco de dados relacional, que são um tipo de banco de dados usado por organizações em todo o mundo. Este tipo de sistema de gerenciamento de banco de dados relacional é usado para armazenar dados em tabelas e exemplos de tais incluem SQLite, MySQL, Postgres, Oracle etc.

Durante o Moringa DataScience Prep, aprenderemos sobre SQL, pois, como cientistas de dados, podemos ser obrigados a interagir com esses dados por meio do uso de SQL.

Neste bloco de notas, usaremos SQL para aprender como as tabelas em bancos de dados são criadas. Mais especificamente, aprenderemos como a estrutura das tabelas é definida, o que é crítico para determinar a qualidade dos dados. Quanto melhor for a estrutura, mais fácil será limpar os dados.

![texto do link](http://www.cadcobol.com.br/db2_novo_conceito_banco_de_dados_relacional.png)

In [ ]:
# Vamos primeiro carregar uma extensão sql em nosso ambiente
# Esta extensão nos permitirá trabalhar com sql no Colaboratory
#
%load_ext sql
# Em seguida, conectaremos ao nosso banco de dados sqlite em memória
# NB: Este banco de dados deixará de existir assim que a conexão com o banco de dados for encerrada.
# Aprenderemos mais sobre como os bancos de dados são criados posteriormente na preparação.
%sql sqlite://

'Connected: @None'

###Criando uma Tabela

In [ ]:
# Exemplo 1
# Vamos agora definir e criar uma tabela Classmates em nosso banco de dados (se ela não existir).
# Esta tabela terá os campos: PersonID, LastName, FirstName, Phone and Residence conforme mostrado abaixo.
# Em seguida, buscaremos todos os registros da tabela.
#
%%sql 
CREATE TABLE if not exists Classmates (
    PersonID, 
    LastName, 
    FirstName, 
    Phone, 
    Residence
);

 * sqlite://
Done.

[]

In [ ]:
%%sql 
SELECT * FROM Classmates;

 * sqlite://
Done.

[]

In [ ]:
# Desafio 1
# Neste exemplo, criaremos uma tabela chamada Customers
# com as colunas Id, Name, Age, Address, Salary.
# Este tipo de estrutura de tabela pode ser usado pelo sistema de gerenciamento Sacco.
# Em seguida, busque todos os registros da tabela.
#
%%sql
CREATE TABLE Customers(
    Id,
    Name,
    Age
    Address,
    Salary
);
SELECT * FROM Customers;

 * sqlite://
Done.
Done.

[]

In [ ]:
%%sql
SELECT Name FROM Customers;

 * sqlite://
Done.

[]

In [ ]:
# Desafio 2
# Neste exemplo, criaremos uma tabela Students para um sistema de gerenciamento de alunos.
# Isso conterá os seguintes campos,
# AdmissionsNo, FirstName, MiddleName, LastName, DateOfBirth and DateOfAdmission.
# Em seguida, busque todos os registros da tabela Alunos.
#

###Populando a Tabela

In [ ]:
# Exemplo 1
# Vamos popular, ou seja, inserir dados na tabela Classmates com dados 
# Alunos ficticios
%%sql
INSERT INTO Classmates VALUES(123, 'Spain', 'Joel', 59595959553, 'Parque 10');
SELECT * FROM Classmates;

 * sqlite://
1 rows affected.
Done.

[(123, 'Spain', 'Joel', 59595959553, 'Parque 10')]

In [ ]:
# Desafio 1
# Popule a tabela Customers realizada no exercício anterior
#
%%sql
INSERT INTO Customers VALUES(0253, "Jonathas Ribeiro", 20, 10000);
SELECT * FROM Customers;

 * sqlite://
1 rows affected.
Done.

[(253, 'Jonathas Ribeiro', 20, 10000)]

In [ ]:
# Desafio 2
# Popule a tabela Students realizada no exercício anterior
#

###Especificando os dados de uma tabela

In [ ]:
# Exemplo 1
# Ao definir nossa tabela, devemos especificar diferentes tipos de dados.
# Esses tipos de dados irão garantir que a coluna particular armazene apenas
# registros desse tipo, ou seja, a coluna NationalID na tabela de Citizens definida
# abaixo aceita apenas valores inteiros. Esses são valores entre -2.147.483.648 e 2.147.483.647.
# Se for necessário armazenar valores muito menores ou maiores do que o intervalo acima, então
# eles podem usar um tipo de dados diferente, ou seja, typeint ou bigint.
# O tipo de dados varchar conterá letras e números até o limite especificado
# entre colchetes.
#
%%sql
CREATE TABLE IF NOT EXISTS Citizens (
    NationalID int,
    FirstName varchar(255),
    MiddleName varchar(255),
    PostalAddress varchar(255),
    Residence varchar(255),
    Number int DEFAULT 0
);
SELECT * from Citizens;

 * sqlite://
Done.
Done.

[]

In [ ]:
# Desafio 1
# Crie uma tabela Artists com Artist_Id int, Artist_Name 
# varchar(60), Artist_JOB date e Posters_In_Stock boolean
#
%%sql
CREATE TABLE Artists(
    Artist_Id int,
    Artist_Name varchar(60) DEFAULT "Unkow",
    Artist_JOB date,
    Posters_In_Stock bool
);
SELECT * FROM Artists

 * sqlite://
Done.
Done.

[]

In [ ]:
# Desafio 2
# Crie uma tabela customer com CustID com datatype int, LastName 
# com dados varchar(25), FirstName com o tipo de dado varchar(20)
#

###Alterando Conteudo de Tabelas

In [ ]:
# Exemplo 1: Adicionando uma coluna
# Para adicionar uma coluna Gênero à tabela Classmates, fazemos o seguinte,
# em seguida, visualize a tabela para ver as mudanças
#
%%sql 
ALTER TABLE Classmates ADD Gender;
 
SELECT * FROM Classmates;

 * sqlite://
Done.
Done.

[(123, 'Spain', 'Joel', 59595959553, 'Parque 10', None)]

In [ ]:
# Exemplo 4: Confirmação
# Vamos verificar nosso tipo de dados
%%sql
PRAGMA table_info(Classmates);

 * sqlite://
Done.

[(0, 'PersonID', '', 0, None, 0),
 (1, 'LastName', '', 0, None, 0),
 (2, 'FirstName', '', 0, None, 0),
 (3, 'Phone', '', 0, None, 0),
 (4, 'Residence', '', 0, None, 0),
 (5, 'Gender', '', 0, None, 0)]

In [ ]:
%%sql
PRAGMA table_info(Citizens);

 * sqlite://
Done.

[(0, 'NationalID', 'int', 0, None, 0),
 (1, 'FirstName', 'varchar(255)', 0, None, 0),
 (2, 'MiddleName', 'varchar(255)', 0, None, 0),
 (3, 'PostalAddress', 'varchar(255)', 0, None, 0),
 (4, 'Residence', 'varchar(255)', 0, None, 0)]

In [ ]:
# Exemplo 2: Excluindo uma coluna
# Para excluir uma coluna Telefone em uma tabela acima, fazemos o seguinte,
# Em seguida, busque os registros da tabela para confirmar as alterações
#
%%sql 
ALTER TABLE Classmates DROP column Residence;

 * sqlite://
(sqlite3.OperationalError) near "DROP": syntax error
[SQL: ALTER TABLE Classmates DROP column Residence;]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [ ]:
# Exemplo 3
# Podemos alterar o nome da tabela Classmates para Schoolmates, fazendo o seguinte,
# Em seguida, buscar os registros da tabela para confirmar as alterações
#
%%sql  
ALTER TABLE Classmates RENAME TO Schoolmates;

 * sqlite://
Done.

[]

In [ ]:
%%sql
SELECT * FROM Schoolmates;

 * sqlite://
Done.

[(123, 'Spain', 'Joel', 59595959553, 'Parque 10', None)]

###Dropping Table

In [ ]:
# Exemplo 1
# Podemos eliminar nossa tabela usando a instrução DROP TABLE conforme mostrado abaixo
#
%%sql 
DROP TABLE Schoolmates;

 * sqlite://
Done.

[]

In [ ]:
# Exemplo 2
# E finalmente truncar e remover nossa tabela de Citizens de nosso banco de dados
#
%%sql
DELETE from  Citizens;

 * sqlite://
0 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM Citizens;

 * sqlite://
Done.

[]

In [ ]:
# Desafio 1
# Vamos retirar a tabela de Customers de nosso banco de dados
#

### Introdução a Busca no Banco de Dados

In [ ]:
%%sql
SELECT FirstName,MiddleName from Citizens

 * sqlite://
Done.

[]